In [1]:
import pandas as pd

sales = pd.read_csv('../DataSets/1000 Sales Records.csv')
sales['NetProfit'] = sales.TotalRevenue - sales.TotalCost

sales.iloc[: , [1,2,3,4,5]] # to access coloumn using their default index.
# it can help when coloumn name have space in it.

# we can access coloumn according to our own access order. by passing coloumn index(default)
sales.iloc[:,[2,5,3,6,7,8,9,11,14,13,10]].head(4)

# re-arrange coloumns according to our own need.
sales.iloc[:,range(0, 7) + [13] + range(7,13)].head(4)

,Region,Country,ItemType,SalesChannel,OrderPriority,OrderDate,OrderID,TotalProfit,ShipDate,UnitsSold,UnitPrice,UnitCost,TotalRevenue,TotalCost
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,1468506.02,10/31/2014,8446,437.20,263.33,3692591.20,2224085.18
1,North America,Canada,Vegetables,Online,M,11/7/2011,185941302,190526.34,12/8/2011,3018,154.06,90.93,464953.08,274426.74
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,145419.62,12/9/2016,1517,255.28,159.42,387259.76,241840.14
3,Asia,Japan,Cereal,Offline,C,4/10/2010,161442649,294295.98,5/12/2010,3322,205.70,117.11,683335.40,389039.42

In [2]:
# data mining - extracting hidden and useful info from data
#---------------------
# -------Coloumns-----
# getColoumns
# subsetting

# change data types

    # add coloumns
    # remove coloumns
    # rename coloumns
# ---------------

# rename coloumns
sales.rename(columns = {"TotalRevenue" : "Total-revenue"})
sales.head(4)

,Region,Country,ItemType,SalesChannel,OrderPriority,OrderDate,OrderID,ShipDate,UnitsSold,UnitPrice,UnitCost,TotalRevenue,TotalCost,TotalProfit,NetProfit
0,Middle East and North Africa,Libya,Cosmetics,Offline,M,10/18/2014,686800706,10/31/2014,8446,437.20,263.33,3692591.20,2224085.18,1468506.02,1468506.02
1,North America,Canada,Vegetables,Online,M,11/7/2011,185941302,12/8/2011,3018,154.06,90.93,464953.08,274426.74,190526.34,190526.34
2,Middle East and North Africa,Libya,Baby Food,Offline,C,10/31/2016,246222341,12/9/2016,1517,255.28,159.42,387259.76,241840.14,145419.62,145419.62
3,Asia,Japan,Cereal,Offline,C,4/10/2010,161442649,5/12/2010,3322,205.70,117.11,683335.40,389039.42,294295.98,294295.98

In [3]:
# filtering using loc 
sales.loc[(sales.UnitsSold > 200) & (sales.UnitsSold < 300),
         ["UnitsSold","UnitCost", "TotalCost", "TotalProfit"]].head(4)

     UnitsSold  UnitCost  TotalCost  TotalProfit
32         293      6.92    2027.56       706.13
107        213    263.33   56089.29     37034.31
136        285    502.54  143223.90     47233.05
152        271    159.42   43202.82     25978.06

# sorting.

sales.sort_values(["UnitsSold","TotalProfit"],ascending=[True , False])

# removing duplicates
# duplicated()

# imputing  missing means filling missing values
# NaN --> missing values
# detect them
    # 1 stores.info() or stores.count()
    # 2.stores.isna() --> print true where values are missing, ~ or - can be used to reverse the boolean output.
# remove them
    # 1. Delete the rows which have missing values
        stores.dropna()
    # 2. replace missing values with zero or  empty     str""
    # 3. fill , with any central tendency - mean or median , if categorical use mode
        # mode is that category which has highest occuring in the categorical variable.
        # sales.colName.fillna(0)

Note:- if excel has data in this way , how python will treat it
            excel                      python
            #N/A                       "#N/A"
            NULL                       "NULL"
            #Value                     "#Value"
            blank                      NaN
# binning and encoding

binning is process in which continous var(which have some range from -inf to +inf like age salary) to categorical(which have power to divide the data like agegroup).

Encoding -> assigning an alternative value or substitute value
    eg:- salary        wherever present in data, substitute                         #                                          with 
             high      3
             mid       2  
             low       1

            gender     substitue
            1           female
            2           male
        
NaN -->  stands for  missing values  here.   
      
# lambda
# apply --> apply can take function and apply on every element of given series object.

In [4]:
def OddEven(x):
    if(x % 2 == 0):
        return True;
    else:
         return False;
OddEven(13)

False

In [5]:
# lambda functions 
# min/smaller noname  or anonymous function

def capitalizer(x):
    return x.upper()

In [6]:
capitalizer('abc')

'ABC'

In [7]:
# capitalizer function can be replace with lambda function 
lambda x:x.upper()
df =  sales.head(5)
# apply is function by which we can apply particular function to every 

df.Country.apply(capitalizer)

0     LIBYA
1    CANADA
2     LIBYA
3     JAPAN
4      CHAD
Name: Country, dtype: object

In [8]:
lambda x : x * 1000
df.NetProfit.apply(lambda x: x* 10)

0    14685060.2
1     1905263.4
2     1454196.2
3     2942959.8
4      237264.5
Name: NetProfit, dtype: float64

In [9]:
# to apply particular function in multiple coloumns 
df[["UnitsSold", "UnitCost", "NetProfit"]].apply(lambda x: x* 10)

   UnitsSold  UnitCost   NetProfit
0      84460    2633.3  14685060.2
1      30180     909.3   1905263.4
2      15170    1594.2   1454196.2
3      33220    1171.1   2942959.8
4      98450      69.2    237264.5

In [11]:
# groupby is a two step process first create groupby and then apply aggregate on that 
tmp = df.groupby('Country')
tmp.TotalProfit.agg({'SumTotalProfit': 'sum'})

/home/shivay/anaconda2/envs/my_env/lib/python2.7/site-packages/ipykernel_launcher.py:3: FutureWarning: using a dict on a Series for aggregation
is deprecated and will be removed in a future version
  This is separate from the ipykernel package so we can avoid doing imports until

         SumTotalProfit
Country
Canada        190526.34
Chad           23726.45
Japan         294295.98
Libya        1613925.64

In [ ]:
# merging or joining
# two tables logically connected via a common value is join in very simple terms
# joining can be done on basis of multiple scenarios.